{ 
     "article": { 
         "judulProposal": 
         "MEMBANGUN APLIKASI KATALOG CYBEROREN STORE DENGAN MENGGUNAKAN KONSEP SERVERLESS MICRO FRONT-END", 
         "abstrakProposal": 
         "Pertumbuhan teknologi dalam dunia e-commerce memunculkan kebutuhan untuk aplikasi katalog yang responsif, dinamis, dan bersifat modular. Penelitian ini memfokuskan pada pengembangan aplikasi katalog CYBEROREN Store menggunakan pendekatan serverless micro front-end. Pendekatan ini memungkinkan aplikasi untuk bersifat serverless, meningkatkan skalabilitas, dan mempermudah pengelolaan komponen front-end. Kami menggabungkan teknologi serverless dengan arsitektur mikro-front-end untuk menciptakan lingkungan pengembangan yang modular dan terdistribusi. Dalam eksperimen ini, kami mengidentifikasi tantangan dan peluang dalam mengadopsi serverless micro front-end dan mengimplementasikannya ke dalam aplikasi katalog CYBEROREN Store. Kami mengevaluasi kinerja aplikasi, efisiensi sumber daya, dan kemampuan skala otomatis serverless micro front-end, serta mengukur dampaknya terhadap pengalaman pengguna dan manajemen aplikasi secara keseluruhan. Hasil penelitian ini memberikan wawasan mendalam tentang penerapan serverless micro front-end dalam konteks aplikasi e-commerce, menawarkan panduan praktis untuk pengembang, dan memberikan kontribusi pada perkembangan teknologi serverless dan arsitektur mikro-front-end.", 
         "katakunciProposal":
         "<b>Kata kunci:</b> E-Commerce, Serverless Micro Frontend.",
         "latarBelakang1":
         "Dalam era digital yang berkembang pesat, kecintaan terhadap pemrograman dan teknologi semakin meluas di kalangan masyarakat. Namun, sulit untuk menemukan produk fashion yang mencerminkan minat ini dengan kreatif dan unik. Dalam konteks ini, CYBEROREN Store hadir sebagai jawaban atas kebutuhan tersebut. Dengan menggabungkan seni pemrograman dan desain fashion yang modern, aplikasi ini menawarkan platform e-commerce inovatif yang memadukan gaya dengan sentuhan teknologi, memenuhi kebutuhan pasar yang terus berkembang dan menggairahkan para penggemar teknologi.", 
         "deskripsiAplikasi":
         ["Aplikasi Katalog CYBEROREN Store adalah sebuah platform e-commerce yang revolusioner, memadukan kecintaan terhadap pemrograman dengan dunia fashion yang bergaya. Didesain dengan estetika modern dan teknologi terkini, aplikasi ini memberikan pengalaman berbelanja yang unik bagi para penggemar pemrograman. Dengan konsep serverless micro front-end, aplikasi ini menawarkan modularitas tanpa batas, memungkinkan pengguna menjelajahi koleksi-koleksi terbaru yang menggabungkan sentuhan seni coding dengan desain fashion yang kreatif. "], 
         "deskripsiAplikasi1":
         ["<b>Koleksi Fashion Berbasis Coding:</b> Temukan berbagai pilihan pakaian, mulai dari kaos, kemeja, hingga aksesori, yang terinspirasi dari dunia coding. Setiap item didesain dengan detail yang unik, memadukan elemen visual coding dan fashion yang modern.",
         "<b>Personalisasi Pakaian:</b> Pengguna dapat memilih desain, warna, dan ukuran sesuai preferensi mereka. Layanan personalisasi memungkinkan pelanggan menciptakan pakaian yang sesuai dengan gaya dan keinginan mereka sendiri.",
        "<b>Konten Edukatif:</b> Selain berbelanja, aplikasi ini menyediakan konten edukatif tentang dunia pemrograman. Artikel, tutorial, dan sumber daya belajar tersedia untuk membantu pengguna memahami konsep-konsep pemrograman dengan cara yang menyenangkan dan informatif.",
        "<b>Pengalaman Pengguna Interaktif:</b> Antarmuka pengguna yang ramah pengguna memastikan pengalaman berbelanja yang mulus. Pengguna dapat dengan mudah menjelajahi katalog, melihat detail produk, dan melakukan pembelian dengan beberapa klik saja.",
        "<b>Serverless Micro Front-end:</b> Aplikasi ini diimplementasikan menggunakan arsitektur serverless micro front-end, memungkinkan pengelolaan komponen aplikasi secara terdistribusi. Pengguna dapat menikmati kinerja yang cepat, serta skalabilitas dan fleksibilitas tinggi tanpa memerlukan pengelolaan infrastruktur kompleks."], 
         "tujuanAplikasi":
         ["<b>Menghadirkan Pengalaman Berbelanja Unik:</b> CYBEROREN Store bertujuan memberikan pengalaman berbelanja yang unik dan menyenangkan bagi pengguna, dengan menghadirkan koleksi fashion yang terinspirasi dari dunia pemrograman dan teknologi.","<b>Memajukan Dunia Pemrograman:</b> Melalui konten edukatif dan inspiratif, aplikasi ini bertujuan untuk memajukan pemahaman dan minat masyarakat terhadap dunia pemrograman, memberikan informasi yang mudah diakses sekaligus menginspirasi generasi mendatang.", "<b>Memberdayakan Pengguna:</b> CYBEROREN Store berkomitmen untuk memberdayakan pengguna dengan memungkinkan mereka untuk berpartisipasi dalam proses kreatif. Pengguna dapat mempersonalisasi pakaian sesuai dengan preferensi mereka, memberikan mereka kendali penuh atas gaya dan desain yang mereka kenakan.","<b>Menggabungkan Inovasi Teknologi:</b> Dengan mengimplementasikan konsep serverless micro front-end, tujuan aplikasi ini adalah memperkenalkan inovasi teknologi yang canggih ke dalam dunia e-commerce. Ini menciptakan platform yang scalable, efisien, dan mudah dikelola bagi pengguna dan pengelola aplikasi.","<b>Mendorong Kreativitas dan Ekspresi:</b> CYBEROREN Store ingin menjadi sarana bagi para desainer dan penggemar fashion untuk mengekspresikan kreativitas mereka. Dengan mempersembahkan desain pakaian yang unik, aplikasi ini mendorong kreativitas dalam dunia fashion dengan memadukannya dengan elemen-elemen teknologi yang menarik."],
         "lingkupDokumentasi": 
         ["<b>Dokumentasi Literatur:</b> Dokumentasi ini merupakan kegiatan mencari informasi dan referensi dari buku, majalah, jurnal, internet yang memudahkan dalam penyusunan analisa.","<b>Dokumentasi Korporil:</b> Dokumentasi ini merupakan kegiatan mencari, mengumpulkan bukti-bukti yang memperkuat hasil dari referensi." ],
        "waktuPelaksanaan": 
         "Kami memproyeksikan waktu pelaksanaan selama 3 bulan, termasuk pengembangan, pengujian website."
     }
 }