{
    "Judul": "WHATSAPP AUTOSENDER",
    "Proposal": "PROPOSAL PROYEK III",
    "Ditunjukan": "Ditujukan Sebagai Salah Satu Syarat Untuk Memperoleh Nilai Pada Kegiatan Proyek 3 Program Studi DIV Teknik Informatika",
    "Oleh": "Oleh",
    "logo": "https://raw.githubusercontent.com/Fancyyy21/cobainrepo/main/assets/img/logoulbi.png",
    "ZZ":"DASLAN JOSUA VALENTINO SIAHAAN (1214011)",
    "ZZX":"MARJUNATI PUTRI(1214001)",
    "Program": "Studi Diploma IV Teknik Informatika Universitas Logistik dan Bisnis Internasional 2022",
    "Abstrak": "WhatsApp Autosender adalah sebuah alat atau perangkat lunak yang dirancang untuk mengirim pesan otomatis melalui platform pesan instan WhatsApp. Alat ini dapat digunakan dalam berbagai konteks, baik untuk tujuan pribadi maupun bisnis. Penggunaan umum termasuk pemasaran, promosi, notifikasi otomatis, pengingat, dan respon otomatis.",
    "KataKunci": [
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    "PENDAHULUAN":"PENDAHULUAN",
    "ZZC":"1. Deskripsi Aplikasi",
    "ZZV":"WhatsApp Sender adalah sebuah aplikasi atau sistem yang memungkinkan penggunanya untuk mengirim pesan WhatsApp dalam jumlah besar atau otomatis. Aplikasi ini biasanya digunakan untuk tujuan pemasaran atau komunikasi massal.",
    "ZZB":"Fitur Utama:",
    "ZZN":"1. Autosender mempermudah pengguna dalam mengirim pesan ke banyak orang sekaligus atau untuk menjalankan kampanye pemasaran, notifikasi, atau komunikasi lainnya yang melibatkan sejumlah besar kontak WhatsApp.",
    "ZZMM":"-.",
    "DeskripsiAplikasi": "2. Latar Belakang Masalah",
    "LatarBelakangMasalah": "Kemajuan teknologi membawa dampak yang sangat pesat bagi kehidupan, terutama dalam era digital sekarang. Banyak platform digital yang membutuhkan pesan instan, karna meningkatnya inflasi yang ada. Maka dibutuhkan WA Autosender sebagai alat pesan otomatis  yang digunakan untuk memenuhi kebutuhan komunikasi otomatis dalam berbagai konteks, baik dalam pemasaran, notifikasi, pengingat dan layanan pelanggan ( customer servis). Selain itu, akan ada fitur2 yang akan ditambahkan demi menunjang dalam perkembangan WA auto sender. WA Autosender dibuat agar memahami bagaimana sistemnya merespons terhadap kebutuhan dan koomunikasi yang efisien dalam era digital yang semakin terhubung. WA Auto sender diharapkan agar bisa melibatakan analisis lebih lanjut bagaimana WA Autosender dapat digunakan oleh individu, bisnis, dan masyarakat umum.",
    "Tujuan": [
       " 1.Menghadirkan Pengalaman Berbelanja Unik: CYBEROREN Store bertujuan memberikan pengalaman berbelanja yang unik dan menyenangkan bagi pengguna, dengan menghadirkan koleksi fashion yang terinspirasi dari dunia pemrograman dan teknologi.",
        "2.Memajukan Dunia Pemrograman: Melalui konten edukatif dan inspiratif, aplikasi ini bertujuan untuk memajukan pemahaman dan minat masyarakat terhadap dunia pemrograman, memberikan informasi yang mudah diakses sekaligus menginspirasi generasi mendatang.",
        "3.Memberdayakan Pengguna: CYBEROREN Store berkomitmen untuk memberdayakan pengguna dengan memungkinkan mereka untuk berpartisipasi dalam proses kreatif. Pengguna dapat mempersonalisasi pakaian sesuai dengan preferensi mereka, memberikan mereka kendali penuh atas gaya dan desain yang mereka kenakan.",
        "4.Menggabungkan Inovasi Teknologi: Dengan mengimplementasikan konsep serverless micro front-end, tujuan aplikasi ini adalah memperkenalkan inovasi teknologi yang canggih ke dalam dunia e-commerce. Ini menciptakan platform yang scalable, efisien, dan mudah dikelola bagi pengguna dan pengelola aplikasi.",
        "5.Mendorong Kreativitas dan Ekspresi: CYBEROREN Store ingin menjadi sarana bagi para desainer dan penggemar fashion untuk mengekspresikan kreativitas mereka. Dengan mempersembahkan desain pakaian yang unik, aplikasi ini mendorong kreativitas dalam dunia fashion dengan memadukannya dengan elemen-elemen teknologi yang menarik."],
    "LingkupDokumentasi": "4.Lingkup Dokumentasi",
    "KajianPustaka": "Adapun ruang lingkup dokumentasi sebagai berikut:",
    "Pembimbing": [
       "1.Dokumentasi Literatur Dokumentasi ini merupakan kegiatan mencari informasi dan referensi dari buku, majalah, jurnal, internet yang memudahkan dalam penyusunan analisa.",
    "2.Dokumentasi Korporil Dokumentasi ini merupakan kegiatan mencari, mengumpulkan bukti-bukti yang memperkuat hasil dari referensi."
    ],
    "TanggalMulai": "4.KAJIAN PUSTAKA",
    "TanggalSelesai": "1.Landasan Teori",
    "HasilProyek": "1.1 Aplikasi",
    "Kontak": "Aplikasi (lebih dikenal sebagai aplikasi) adalah perangkat lunak yang menggabungkan beberapa fitur tertentu dengan cara yang dapat diakses oleh pengguna. Ada jutaan aplikasi di App Store dan toko aplikasi Android, yang menawarkan layanan aplikasi. Aplikasi sendiri adalah dasar dari ekonomi seluler. Sejak kedatangan iPhone pada 2007 dan App Store pada 2008, aplikasi telah menjadi cara utama pengguna memasuki revolusi ponsel cerdas atau smartphone. Selain itu, aplikasi telah membantu menciptakan sejumlah industri multi-miliar dolar. Menurut wikipedia, Aplikasi perangkat lunak adalah suatu sub-kelas perangkat lunak komputer yang memanfaatkan kemampuan komputer langsung untuk melakukan suatu tugas yang diinginkan pengguna.",
    "Target Audience": "Proyek ini ditujukan kepada mahasiswa Program Studi DIV Teknik Informatika yang ingin memperdalam pengetahuan mereka tentang pengembangan aplikasi web dan teknologi terkini dalam industri perangkat lunak. Ini juga merupakan salah satu syarat untuk memperoleh nilai dalam Kegiatan Proyek 2 Program Studi DIV Teknik Informatika.",
    "FiturUtama": "Aplikasi berasal dari kata Aplication yang menurut kamus Komputer Eksekutif (1993:9), Aplication adalah masalah yang memakai teknik pemrosesan data aplikasi biasanya mengacu pada komputasi yang diinginkan, atau pemrosesan data. Jika menurut salah satu para ahli yaitu Yan Tirtobisono (1999:21), aplikasi  adalah istilah yang digunakan untuk pengguna komputer bagi pemecahan masalah. Biasanya istilah aplikasi dipasangkan atau digabungkan dengan suatu perangkat lunak misalnya Microsoft Visual Basic 6.0, akan dapat memberikan makna atau arti baru yaitu suatu program yang ditulis atau dibuat untuk menangani masalah tertentu. ",
    "Manfaat": "1.2 Micro Frontend",
    "a":"Micro Frontend adalah pendekatan dalam pengembangan perangkat lunak berbasis web yang memecah antarmuka pengguna (frontend) suatu aplikasi menjadi sejumlah komponen yang lebih kecil, terpisah, dan dapat dikelola secara independen. Setiap komponen ini, yang disebut microfrontend dapat memiliki tim pengembangan yang terdedikasi dan dapat ditempatkan dalam konteks aplikasi yang lebih besar. Pendekatan ini bertujuan untuk meningkatkan modularitas, skalabilitas, dan fleksibilitas dalam pengembangan frontend.",
    "b":"Salah satu pemikiran terkenal dalam konsep Micro Frontend diberikan oleh Cam Jackson, seorang insinyur perangkat lunak terkemuka. Menurut Jackson, Micro Frontend adalah pendekatan arsitektur frontend yang berfokus pada pembuatan komponen frontend yang dapat digunakan kembali, terpisah, dan dapat dikelola oleh tim yang berbeda secara independen. Pendekatan ini mirip dengan pendekatan mikroservice dalam pengembangan backend, yang mengizinkan pengembangan dan pemeliharaan yang lebih mandiri dan efisien.",
    "c":"Dalam praktiknya, Micro Frontend memungkinkan pengembang untuk fokus pada pengembangan dan pemeliharaan komponen tertentu dalam aplikasi tanpa perlu memahami keseluruhan struktur aplikasi secara mendalam. Hal ini memungkinkan perubahan yang lebih cepat dan lebih terfokus dalam pengembangan, serta meningkatkan kolaborasi antara tim yang bekerja pada komponen-komponen tersebut. Keseluruhannya, Micro Frontend memungkinkan perbaikan dalam manajemen kompleksitas dalam pengembangan frontend dan memungkinkan aplikasi web yang lebih mudah diubah dan dikembangkan seiring waktu.",
    "d":"1.3 JavaScript",
    "e":"JavaScript adalah bahasa pemrograman yang sangat penting dalam pengembangan aplikasi web dan telah menjadi bahasa yang esensial dalam dunia pemrograman modern. JavaScript, sering disingkat sebagai JS, dikembangkan pada tahun 1995 oleh Brendan Eich ketika bekerja di Netscape Communications Corporation. Bahasa ini awalnya diciptakan untuk meningkatkan interaktivitas dalam browser web, dan sejak itu telah berkembang menjadi bahasa pemrograman serbaguna yang digunakan dalam berbagai lingkungan pengembangan.",
    "f":"Salah satu ahli dalam dunia JavaScript adalah Douglas Crockford, yang dikenal karena kontribusinya dalam mempopulerkan bahasa ini dan memperkenalkan berbagai praktik terbaik dalam penggunaan JavaScript. Menurut Crockford, JavaScript adalah bahasa pemrograman yang ringan, berorientasi objek, berbasis prototipe, dan tingkat tinggi. Poin-poin utama dalam definisi ini adalah ringan yang merujuk pada kemampuan JavaScript untuk berjalan di browser dengan cepat dan efisien, serta berbasis prototipe yang menekankan model warisan JavaScript yang unik, yang memungkinkan objek untuk mengambil sifat dari objek lain tanpa harus menggunakan kelas seperti dalam bahasa lain.",
    "g":"JavaScript digunakan untuk mengendalikan perilaku dan interaksi pada situs web, seperti validasi formulir, animasi, manipulasi DOM (Document Object Model), dan komunikasi dengan server melalui teknologi seperti AJAX. Selain itu, dengan munculnya runtime lingkungan seperti Node.js, JavaScript juga dapat digunakan untuk pengembangan server-side, memungkinkan pengembang untuk mengembangkan aplikasi berbasis JavaScript dari sisi server hingga sisi klien. Keseluruhannya, JavaScript adalah bahasa pemrograman yang sangat berpengaruh dan terus berkembang dalam dunia teknologi informasi dan pengembangan web.",
    "h":"JADWAL PELAKSANAAN",
    "i":"Proposal ini dibuat dengan jangka waktu 3 bulan. Adapun detail pengerjannya sebagai berikut:"
}
