{
    "Judul": "MEMBANGUN APLIKASI KATALOG CYBEROREN GATEAWAY DENGAN MENGGUNAKAN KONSEP SERVERLESS MICRO FRONT-END",
    "Proposal": "PROPOSAL PROYEK III",
    "Ditunjukan": "Ditujukan Sebagai Salah Satu Syarat Untuk Memperoleh Nilai Pada Kegiatan Proyek 3 Program Studi DIV Teknik Informatika",
    "Oleh": "Oleh",
    "logo": "https://raw.githubusercontent.com/Fancyyy21/cobainrepo/main/assets/img/logoulbi.png",
    "ZZ":"MAULANA IMANULHAQ NURDIANA (1214078)",
    "ZZX":"RAUL MAHYA KOMARAN (1214053)",
    "Program": "Studi Diploma IV Teknik Informatika Universitas Logistik dan Bisnis Internasional 2022",
    "Abstrak": "Pertumbuhan teknologi dalam dunia e-commerce memunculkan kebutuhan untuk aplikasi katalog yang responsif, dinamis, dan bersifat modular. Penelitian ini memfokuskan pada pengembangan aplikasi katalog CYBEROREN GATEAWAY menggunakan pendekatan serverless micro front-end. Pendekatan ini memungkinkan aplikasi untuk bersifat serverless, meningkatkan skalabilitas, dan mempermudah pengelolaan komponen front-end. Kami menggabungkan teknologi serverless dengan arsitektur mikro-front-end untuk menciptakan lingkungan pengembangan yang modular dan terdistribusi. Dalam eksperimen ini, kami mengidentifikasi tantangan dan peluang dalam mengadopsi serverless micro front-end dan mengimplementasikannya ke dalam aplikasi katalog CYBEROREN GATEAWAY. Kami mengevaluasi kinerja aplikasi, efisiensi sumber daya, dan kemampuan skala otomatis serverless micro front-end, serta mengukur dampaknya terhadap pengalaman pengguna dan manajemen aplikasi secara keseluruhan. Hasil penelitian ini memberikan wawasan mendalam tentang penerapan serverless micro front-end dalam konteks aplikasi e-commerce, menawarkan panduan praktis untuk pengembang, dan memberikan kontribusi pada perkembangan teknologi serverless dan arsitektur mikro-front-end.",
    "KataKunci": [
        "Serverless",
        "Micro Front-end",
        "E-Commerce",
        "Katalog",
        "CYBEROREN GATEAWAY"
    ],
    "PENDAHULUAN":"PENDAHULUAN",
    "ZZC":"1. Deskripsi Aplikasi",
    "ZZV":"Aplikasi Katalog CYBEROREN GATEAWAY adalah sebuah platform e-commerce yang revolusioner, memadukan kecintaan terhadap pemrograman dengan dunia fashion yang bergaya. Didesain dengan estetika modern dan teknologi terkini, aplikasi ini memberikan pengalaman berbelanja yang unik bagi para penggemar pemrograman. Dengan konsep serverless micro front-end, aplikasi ini menawarkan modularitas tanpa batas, memungkinkan pengguna menjelajahi koleksi-koleksi terbaru yang menggabungkan sentuhan seni coding dengan desain fashion yang kreatif.",
    "ZZB":"Fitur Utama:",
    "ZZN":"1.Koleksi Fashion Berbasis Coding: Temukan berbagai pilihan pakaian, mulai dari kaos, kemeja, hingga aksesori, yang terinspirasi dari dunia coding. Setiap item didesain dengan detail yang unik, memadukan elemen visual coding dan fashion yang modern.2.Personalisasi Pakaian: Pengguna dapat memilih desain, warna, dan ukuran sesuai preferensi mereka. Layanan personalisasi memungkinkan pelanggan menciptakan pakaian yang sesuai dengan gaya dan keinginan mereka sendiri.3.Konten Edukatif: Selain berbelanja, aplikasi ini menyediakan konten edukatif tentang dunia pemrograman. Artikel, tutorial, dan sumber daya belajar tersedia untuk membantu pengguna memahami konsep-konsep pemrograman dengan cara yang menyenangkan dan informatif.4.Pengalaman Pengguna Interaktif: Antarmuka pengguna yang ramah pengguna memastikan pengalaman berbelanja yang mulus. Pengguna dapat dengan mudah menjelajahi katalog, melihat detail produk, dan melakukan pembelian dengan beberapa klik saja.5.Serverless Micro Front-end: Aplikasi ini diimplementasikan menggunakan arsitektur serverless micro front-end, memungkinkan pengelolaan komponen aplikasi secara terdistribusi. Pengguna dapat menikmati kinerja yang cepat, serta skalabilitas dan fleksibilitas tinggi tanpa memerlukan pengelolaan infrastruktur kompleks.",
    "ZZMM":"CYBEROREN GATEAWAY membawa pengalaman berbelanja yang inovatif, menggabungkan pemrograman dan fashion dalam satu platform yang menarik dan edukatif. Dengan kombinasi teknologi canggih dan kreativitas, aplikasi ini memenuhi kebutuhan pengguna yang mencari pakaian yang tidak hanya stylish, tetapi juga bermakna dalam dunia teknologi.",
    "DeskripsiAplikasi": "2. Latar Belakang Masalah",
    "LatarBelakangMasalah": "Dalam era digital yang berkembang pesat, kecintaan terhadap pemrograman dan teknologi semakin meluas di kalangan masyarakat. Namun, sulit untuk menemukan produk fashion yang mencerminkan minat ini dengan kreatif dan unik. Dalam konteks ini, CYBEROREN GATEAWAY hadir sebagai jawaban atas kebutuhan tersebut. Dengan menggabungkan seni pemrograman dan desain fashion yang modern, aplikasi ini menawarkan platform e-commerce inovatif yang memadukan gaya dengan sentuhan teknologi, memenuhi kebutuhan pasar yang terus berkembang dan menggairahkan para penggemar teknologi.",
    "Tujuan": [
       " 1.Menghadirkan Pengalaman Berbelanja Unik: CYBEROREN GATEAWAY bertujuan memberikan pengalaman berbelanja yang unik dan menyenangkan bagi pengguna, dengan menghadirkan koleksi fashion yang terinspirasi dari dunia pemrograman dan teknologi.",
        "2.Memajukan Dunia Pemrograman: Melalui konten edukatif dan inspiratif, aplikasi ini bertujuan untuk memajukan pemahaman dan minat masyarakat terhadap dunia pemrograman, memberikan informasi yang mudah diakses sekaligus menginspirasi generasi mendatang.",
        "3.Memberdayakan Pengguna: CYBEROREN GATEAWAY berkomitmen untuk memberdayakan pengguna dengan memungkinkan mereka untuk berpartisipasi dalam proses kreatif. Pengguna dapat mempersonalisasi pakaian sesuai dengan preferensi mereka, memberikan mereka kendali penuh atas gaya dan desain yang mereka kenakan.",
        "4.Menggabungkan Inovasi Teknologi: Dengan mengimplementasikan konsep serverless micro front-end, tujuan aplikasi ini adalah memperkenalkan inovasi teknologi yang canggih ke dalam dunia e-commerce. Ini menciptakan platform yang scalable, efisien, dan mudah dikelola bagi pengguna dan pengelola aplikasi.",
        "5.Mendorong Kreativitas dan Ekspresi: CYBEROREN GATEAWAY ingin menjadi sarana bagi para desainer dan penggemar fashion untuk mengekspresikan kreativitas mereka. Dengan mempersembahkan desain pakaian yang unik, aplikasi ini mendorong kreativitas dalam dunia fashion dengan memadukannya dengan elemen-elemen teknologi yang menarik."],
    "LingkupDokumentasi": "4.Lingkup Dokumentasi",
    "KajianPustaka": "Adapun ruang lingkup dokumentasi sebagai berikut:",
    "Pembimbing": [
       "1.Dokumentasi Literatur Dokumentasi ini merupakan kegiatan mencari informasi dan referensi dari buku, majalah, jurnal, internet yang memudahkan dalam penyusunan analisa.",
    "2.Dokumentasi Korporil Dokumentasi ini merupakan kegiatan mencari, mengumpulkan bukti-bukti yang memperkuat hasil dari referensi."
    ],
    "TanggalMulai": "4.KAJIAN PUSTAKA",
    "TanggalSelesai": "1.Landasan Teori",
    "HasilProyek": "1.1 Aplikasi",
    "Kontak": "Aplikasi (lebih dikenal sebagai aplikasi) adalah perangkat lunak yang menggabungkan beberapa fitur tertentu dengan cara yang dapat diakses oleh pengguna. Ada jutaan aplikasi di App GATEAWAY dan toko aplikasi Android, yang menawarkan layanan aplikasi. Aplikasi sendiri adalah dasar dari ekonomi seluler. Sejak kedatangan iPhone pada 2007 dan App GATEAWAY pada 2008, aplikasi telah menjadi cara utama pengguna memasuki revolusi ponsel cerdas atau smartphone. Selain itu, aplikasi telah membantu menciptakan sejumlah industri multi-miliar dolar. Menurut wikipedia, Aplikasi perangkat lunak adalah suatu sub-kelas perangkat lunak komputer yang memanfaatkan kemampuan komputer langsung untuk melakukan suatu tugas yang diinginkan pengguna.",
    "Target Audience": "Proyek ini ditujukan kepada mahasiswa Program Studi DIV Teknik Informatika yang ingin memperdalam pengetahuan mereka tentang pengembangan aplikasi web dan teknologi terkini dalam industri perangkat lunak. Ini juga merupakan salah satu syarat untuk memperoleh nilai dalam Kegiatan Proyek 2 Program Studi DIV Teknik Informatika.",
    "FiturUtama": "Aplikasi berasal dari kata Aplication yang menurut kamus Komputer Eksekutif (1993:9), Aplication adalah masalah yang memakai teknik pemrosesan data aplikasi biasanya mengacu pada komputasi yang diinginkan, atau pemrosesan data. Jika menurut salah satu para ahli yaitu Yan Tirtobisono (1999:21), aplikasi  adalah istilah yang digunakan untuk pengguna komputer bagi pemecahan masalah. Biasanya istilah aplikasi dipasangkan atau digabungkan dengan suatu perangkat lunak misalnya Microsoft Visual Basic 6.0, akan dapat memberikan makna atau arti baru yaitu suatu program yang ditulis atau dibuat untuk menangani masalah tertentu. ",
    "Manfaat": "1.2 Micro Frontend",
    "a":"Micro Frontend adalah pendekatan dalam pengembangan perangkat lunak berbasis web yang memecah antarmuka pengguna (frontend) suatu aplikasi menjadi sejumlah komponen yang lebih kecil, terpisah, dan dapat dikelola secara independen. Setiap komponen ini, yang disebut microfrontend dapat memiliki tim pengembangan yang terdedikasi dan dapat ditempatkan dalam konteks aplikasi yang lebih besar. Pendekatan ini bertujuan untuk meningkatkan modularitas, skalabilitas, dan fleksibilitas dalam pengembangan frontend.",
    "b":"Salah satu pemikiran terkenal dalam konsep Micro Frontend diberikan oleh Cam Jackson, seorang insinyur perangkat lunak terkemuka. Menurut Jackson, Micro Frontend adalah pendekatan arsitektur frontend yang berfokus pada pembuatan komponen frontend yang dapat digunakan kembali, terpisah, dan dapat dikelola oleh tim yang berbeda secara independen. Pendekatan ini mirip dengan pendekatan mikroservice dalam pengembangan backend, yang mengizinkan pengembangan dan pemeliharaan yang lebih mandiri dan efisien.",
    "c":"Dalam praktiknya, Micro Frontend memungkinkan pengembang untuk fokus pada pengembangan dan pemeliharaan komponen tertentu dalam aplikasi tanpa perlu memahami keseluruhan struktur aplikasi secara mendalam. Hal ini memungkinkan perubahan yang lebih cepat dan lebih terfokus dalam pengembangan, serta meningkatkan kolaborasi antara tim yang bekerja pada komponen-komponen tersebut. Keseluruhannya, Micro Frontend memungkinkan perbaikan dalam manajemen kompleksitas dalam pengembangan frontend dan memungkinkan aplikasi web yang lebih mudah diubah dan dikembangkan seiring waktu.",
    "d":"1.3 JavaScript",
    "e":"JavaScript adalah bahasa pemrograman yang sangat penting dalam pengembangan aplikasi web dan telah menjadi bahasa yang esensial dalam dunia pemrograman modern. JavaScript, sering disingkat sebagai JS, dikembangkan pada tahun 1995 oleh Brendan Eich ketika bekerja di Netscape Communications Corporation. Bahasa ini awalnya diciptakan untuk meningkatkan interaktivitas dalam browser web, dan sejak itu telah berkembang menjadi bahasa pemrograman serbaguna yang digunakan dalam berbagai lingkungan pengembangan.",
    "f":"Salah satu ahli dalam dunia JavaScript adalah Douglas Crockford, yang dikenal karena kontribusinya dalam mempopulerkan bahasa ini dan memperkenalkan berbagai praktik terbaik dalam penggunaan JavaScript. Menurut Crockford, JavaScript adalah bahasa pemrograman yang ringan, berorientasi objek, berbasis prototipe, dan tingkat tinggi. Poin-poin utama dalam definisi ini adalah ringan yang merujuk pada kemampuan JavaScript untuk berjalan di browser dengan cepat dan efisien, serta berbasis prototipe yang menekankan model warisan JavaScript yang unik, yang memungkinkan objek untuk mengambil sifat dari objek lain tanpa harus menggunakan kelas seperti dalam bahasa lain.",
    "g":"JavaScript digunakan untuk mengendalikan perilaku dan interaksi pada situs web, seperti validasi formulir, animasi, manipulasi DOM (Document Object Model), dan komunikasi dengan server melalui teknologi seperti AJAX. Selain itu, dengan munculnya runtime lingkungan seperti Node.js, JavaScript juga dapat digunakan untuk pengembangan server-side, memungkinkan pengembang untuk mengembangkan aplikasi berbasis JavaScript dari sisi server hingga sisi klien. Keseluruhannya, JavaScript adalah bahasa pemrograman yang sangat berpengaruh dan terus berkembang dalam dunia teknologi informasi dan pengembangan web.",
    "h":"JADWAL PELAKSANAAN",
    "i":"Proposal ini dibuat dengan jangka waktu 3 bulan. Adapun detail pengerjannya sebagai berikut:"
}
